rules-processing-server/src/test/resources/QutoeRequest.xml

<soapenv:Envelope 
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:app="http://app.mcarta.com/" 
xmlns:x="http://www.ACORD.org/standards/PC_Surety/ACORD1/xml/">
   <soapenv:Header/>
   <soapenv:Body>
      <app:ACORDRq>
 	<app:SignonRq>
		<x:SignonPswd>
			<x:CustId>
				<x:SPName>ADMIN</x:SPName>
				<x:CustPermId>456</x:CustPermId>
				<x:CustLoginId>123</x:CustLoginId>
			</x:CustId>
			<x:CustPswd>
				<x:EncryptionTypeCd>NONE</x:EncryptionTypeCd>
				<x:Pswd>sds</x:Pswd>
			</x:CustPswd>
			<x:PIN>234234</x:PIN>
		</x:SignonPswd>
		<x:ClientDt>2010-10-10</x:ClientDt>
		<x:CustLangPref>ENG</x:CustLangPref>
		<x:ClientApp>
			<x:Org>AEM</x:Org>
			<x:Name>Vizuri</x:Name>
			<x:Version>2.1</x:Version>
		</x:ClientApp>
	</app:SignonRq>
	<app:InsuranceSvcRq>
		<x:RqUID>12345678-1234-1234-1234-123456789012</x:RqUID>
		<x:HomePolicyQuoteInqRq>
			<x:RqUID>12345678-1234-1234-1234-123456789012</x:RqUID>
			<x:TransactionRequestDt>2013-06-06</x:TransactionRequestDt>
			<x:TransactionEffectiveDt>2013-08-02</x:TransactionEffectiveDt>
			<x:CurCd>USD</x:CurCd>			
			<x:InsuredOrPrincipal>
				<x:GeneralPartyInfo>
					<x:NameInfo>
						<x:PersonName>
							<x:Surname>Bush</x:Surname>
							<x:GivenName>George</x:GivenName>
							<x:NameSuffix>Jr</x:NameSuffix>
							<x:NickName>GWBush</x:NickName>
						</x:PersonName>
					</x:NameInfo>
					<x:Addr>
						<x:AddrTypeCd>MailingAddress</x:AddrTypeCd>
						<x:Addr1>19910 Alton Sq</x:Addr1>
						<x:Addr2>Apt 112</x:Addr2>
						<x:City>Herndon</x:City>
						<x:StateProv>VA</x:StateProv>
						<x:PostalCode>20170</x:PostalCode>
						<x:CountryCd>us</x:CountryCd>
					</x:Addr>
					<x:Communications>
						<x:PhoneInfo>
							<x:PhoneTypeCd>Phone</x:PhoneTypeCd>
							<x:PhoneNumber>+1-703-4567654+00000</x:PhoneNumber>
						</x:PhoneInfo>
						<x:EmailInfo>
							<x:EmailAddr>support@mcarta.com</x:EmailAddr>
						</x:EmailInfo>
					</x:Communications>
				</x:GeneralPartyInfo>
				<x:InsuredOrPrincipalInfo>
					<x:PersonInfo>
						<x:GenderCd>M</x:GenderCd>
						<x:BirthDt>1980-08-08</x:BirthDt>
						<x:MaritalStatusCd>M</x:MaritalStatusCd>
						<x:OccupationDesc>Engineer</x:OccupationDesc>
						<x:TitleRelationshipCd>Empl</x:TitleRelationshipCd>
						<x:LengthTimeEmployed>
							<x:NumUnits>4.6</x:NumUnits>
						</x:LengthTimeEmployed>
						<x:LengthTimeWithPreviousEmployer>
							<x:NumUnits>8.2</x:NumUnits>
						</x:LengthTimeWithPreviousEmployer>
						<x:LengthTimeCurrentAddr>
							<x:EffectiveDt>2002-04-04</x:EffectiveDt>
						</x:LengthTimeCurrentAddr>
						<x:EmployerCd>AccountingFirm</x:EmployerCd>
						<x:EmployerDesc>NA</x:EmployerDesc>
						<x:CitizenshipCountryCd>us</x:CitizenshipCountryCd>
						<x:NumDependents>2</x:NumDependents>
						<x:EducationLevelCd>MastersDegree</x:EducationLevelCd>
					</x:PersonInfo>
				</x:InsuredOrPrincipalInfo>
			</x:InsuredOrPrincipal>
			
			<x:PersPolicy>
				<x:LOBCd>HOME</x:LOBCd>
				<x:OtherOrPriorPolicy>
					<x:PolicyCd>Prior</x:PolicyCd>
					<x:PolicyNumber>443334444</x:PolicyNumber>
					<x:LOBCd>HOME</x:LOBCd>
					<x:InsurerName>Nationwide Homeowners Insurance</x:InsurerName>
					<x:OriginalInceptionDt>2007-02-02</x:OriginalInceptionDt>
					<x:PolicyTerminatedReasonDesc>Rates went up </x:PolicyTerminatedReasonDesc>
					<x:PolicyAmt>
						<x:Amt>800</x:Amt>
					</x:PolicyAmt>
					<x:NumLosses>1</x:NumLosses>
					<x:LossesDesc>Describe Prior Losses in detail	OR Sandy Related Claims</x:LossesDesc>
					<x:TotalPaidLossesAmt>
						<x:Amt>24000</x:Amt>
					</x:TotalPaidLossesAmt>
					<x:CancelDeclineDt>2012-02-04</x:CancelDeclineDt>
				</x:OtherOrPriorPolicy>
			</x:PersPolicy>
			
			<x:HomeLineBusiness>
				<x:LOBCd>HOME</x:LOBCd>
				<x:Dwell>
					<x:PrincipalUnitAtRiskInd>0</x:PrincipalUnitAtRiskInd>
					<x:PurchaseDt>2013-08-01</x:PurchaseDt>
					<x:PurchasePriceAmt>
						<x:Amt>350000</x:Amt>
					</x:PurchasePriceAmt>
					<x:ThermostaticallyControlledCentralHeatInd>1</x:ThermostaticallyControlledCentralHeatInd>
					<x:Construction>
						<x:ConstructionCd>Brick</x:ConstructionCd>
						<x:YearBuilt>2008</x:YearBuilt>
						<x:NumStories>3</x:NumStories>
						<x:NumUnits>1</x:NumUnits>
						<x:HeatingSystemServiceDt>2012-02-02</x:HeatingSystemServiceDt>
						<x:InsulationTypeCd>Foam</x:InsulationTypeCd>
						<x:ElectricalStrength>
							<x:NumUnits>150</x:NumUnits>
						</x:ElectricalStrength>
						<x:Capacity>
							<x:NumUnits>120</x:NumUnits>
						</x:Capacity>
						<x:FinishedConstructionPct>100</x:FinishedConstructionPct>
						<x:BldgPermitDt>2001-03-03</x:BldgPermitDt>
						<x:DemolishionOrRemodelingDesc>None</x:DemolishionOrRemodelingDesc>
					</x:Construction>
					<x:DwellOccupancy>
						<x:YearOccupancy>2013</x:YearOccupancy>
						<x:ResidenceTypeCd>TH</x:ResidenceTypeCd>
						<x:DwellUseCd>1</x:DwellUseCd>
						<x:OccupancyTypeCd>OWNER</x:OccupancyTypeCd>
						<x:NumResidentsInHousehold>4</x:NumResidentsInHousehold>
					</x:DwellOccupancy>
					<x:DwellRating>
						<x:ClassSpecificRatedCd>CLR</x:ClassSpecificRatedCd>
						<x:CrimeIndexCd>1</x:CrimeIndexCd>
					</x:DwellRating>
					<x:DwellInspectionValuation>
						<x:DwellStyleCd>Bungalow</x:DwellStyleCd>
						<x:EstimatedReplCostAmt>
							<x:Amt>225000</x:Amt>
						</x:EstimatedReplCostAmt>
						<x:EvaluationMethodCd>1</x:EvaluationMethodCd>
						<x:PhotographObtainedInd>0</x:PhotographObtainedInd>
						<x:TotalLivingArea>
							<x:NumUnits>2500</x:NumUnits>
						</x:TotalLivingArea>
					</x:DwellInspectionValuation>
					<x:AnimalExposureInfo>
						<x:BreedCd>Doberman</x:BreedCd>
						<x:Description>The dog is a doberman breed</x:Description>
					</x:AnimalExposureInfo>
					<x:QuestionAnswer>
						<x:QuestionCd>HOME01</x:QuestionCd>
						<x:YesNoCd>YES</x:YesNoCd>
						<x:Explanation>Test Notes</x:Explanation>
					</x:QuestionAnswer>
					<x:HeatingUnitInfo>
						<x:CertifiedInd>0</x:CertifiedInd>
						<x:HeatingUnitCd>ForceAirFurn</x:HeatingUnitCd>
						<x:PrimaryInd>1</x:PrimaryInd>
						<x:FireplaceTypeCd>PreFabMetal</x:FireplaceTypeCd>
						<x:StoveTypeCd>C</x:StoveTypeCd>
					</x:HeatingUnitInfo>
					<x:FloodInfo>
						<x:HeightAboveGround>
							<x:NumUnits>4</x:NumUnits>
						</x:HeightAboveGround>
						<x:BuiltInComplianceInd>0</x:BuiltInComplianceInd>
						<x:ShorelineDistanceCd>D</x:ShorelineDistanceCd>
						<x:FloodSourceCd>O</x:FloodSourceCd>
					</x:FloodInfo>
					<x:RoofConditionCd>GD</x:RoofConditionCd>
					<x:PlumbingTypeCd>PVC</x:PlumbingTypeCd>
					<x:ExpirationDt>2016-06-06</x:ExpirationDt>
					<x:CommissionRatePct>2</x:CommissionRatePct>
				</x:Dwell>
				<x:Coverage>
					<x:CoverageCd>DWELL</x:CoverageCd>
					<x:IterationNumber>1</x:IterationNumber>
					<x:CoverageDesc>For Building</x:CoverageDesc>
					<x:Limit>
						<x:FormatCurrencyAmt>
							<x:Amt>250000</x:Amt>
						</x:FormatCurrencyAmt>
					</x:Limit>
					<x:EffectiveDt>2013-04-04</x:EffectiveDt>
					<x:ExpirationDt>2018-04-04</x:ExpirationDt>
				</x:Coverage>
				<x:Coverage>
					<x:CoverageCd>INCB</x:CoverageCd>
					<x:IterationNumber>2</x:IterationNumber>
					<x:CoverageDesc>For Condominium Unit-Owners</x:CoverageDesc>
					<x:Limit>
						<x:FormatCurrencyAmt>
							<x:Amt>250000</x:Amt>
						</x:FormatCurrencyAmt>
					</x:Limit>
					<x:EffectiveDt>2013-04-04</x:EffectiveDt>
					<x:ExpirationDt>2018-04-04</x:ExpirationDt>
				</x:Coverage>
				<x:Coverage>
					<x:CoverageCd>INJL</x:CoverageCd>
					<x:IterationNumber>3</x:IterationNumber>
					<x:CoverageDesc>For Jewelery</x:CoverageDesc>
					<x:Limit>
						<x:FormatCurrencyAmt>
							<x:Amt>250000</x:Amt>
						</x:FormatCurrencyAmt>
					</x:Limit>
					<x:Deductible>
						<x:FormatCurrencyAmt>
							<x:Amt>500</x:Amt>
						</x:FormatCurrencyAmt>
					</x:Deductible>
				</x:Coverage>
				<x:Coverage>
					<x:CoverageCd>AALMT</x:CoverageCd>
					<x:IterationNumber>4</x:IterationNumber>
					<x:CoverageDesc>For Windstorm</x:CoverageDesc>
					<x:Limit>
						<x:FormatCurrencyAmt>
							<x:Amt>250000</x:Amt>
						</x:FormatCurrencyAmt>
					</x:Limit>
					<x:Deductible>
						<x:FormatCurrencyAmt>
							<x:Amt>500</x:Amt>
						</x:FormatCurrencyAmt>
					</x:Deductible>
				</x:Coverage>
				<x:Coverage>
					<x:CoverageCd>PL</x:CoverageCd>
					<x:IterationNumber>4</x:IterationNumber>
					<x:CoverageDesc>For CPL and Medical</x:CoverageDesc>
					<x:Limit>
						<x:FormatCurrencyAmt>
							<x:Amt>250000</x:Amt>
						</x:FormatCurrencyAmt>
					</x:Limit>
					<x:Deductible>
						<x:FormatCurrencyAmt>
							<x:Amt>500</x:Amt>
						</x:FormatCurrencyAmt>
					</x:Deductible>
				</x:Coverage>
				<x:QuestionAnswer>
					<x:QuestionCd>HOME01</x:QuestionCd>
					<x:YesNoCd>YES</x:YesNoCd>
					<x:Explanation>Test Notes</x:Explanation>
				</x:QuestionAnswer>
			</x:HomeLineBusiness>			
		</x:HomePolicyQuoteInqRq>		
	</app:InsuranceSvcRq>
     </app:ACORDRq>
   </soapenv:Body>
</soapenv:Envelope>